Revit 2026 API

# IFCTransaction Constructor

---

Instantiates a transaction object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCTransaction(
	IFCFile file
)
```
```vb
Public Sub New (
	file As IFCFile
)
```
```cpp
public:
IFCTransaction(
	IFCFile^ file
)
```
```fsharp
new :
        file : IFCFile -> IFCTransaction
```

#### Parameters

file IFCFile
     The IFC file for which this transaction is going to be used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The transaction starts by creating a transaction object.

#### Reference

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace